; domain
(define (domain paint-bare-wood)
  (:requirements :strips :typing)

  (:types
    person tool material object
  )

  (:predicates
    ;;
    (has_tool ?p - person ?t - tool)
    (has_paint ?p - person ?m - material)

    ;;
    (clean ?t - tool)
    (dirty ?t - tool)

    ;;
    (present ?o - object)
    (painted_under_coat ?o - object)
    (painted_second_coat ?o - object)
    (finished_painting ?o - object)

    ;;
    (paint_applied ?o - object ?m - material)
  )

  ;;   1：
  (:action acquire_paint
    :parameters (?p - person ?m - material)
    :precondition (and
      (not (has_paint ?p ?m))
    )
    :effect (has_paint ?p ?m)
  )

  ;;   2：
  (:action acquire_tool
    :parameters (?p - person ?t - tool)
    :precondition (and
      (not (has_tool ?p ?t))
    )
    :effect (has_tool ?p ?t)
  )

  ;;   3：
  (:action clean_tool
    :parameters (?t - tool)
    :precondition (and
      (dirty ?t)
    )
    :effect (clean ?t)
  )

  ;;   4：
  (:action apply_under_coat
    :parameters (?p - person ?t - tool ?m - material ?o - object)
    :precondition (and
      (has_paint ?p ?m)
      (has_tool ?p ?t)
      (clean ?t)
      (present ?o)
      (not (painted_under_coat ?o))
    )
    :effect (and
      (paint_applied ?o ?m)
      (painted_under_coat ?o)
      (dirty ?t)
    )
  )

  ;;   5：
  (:action apply_second_coat
    :parameters (?p - person ?t - tool ?m - material ?o - object)
    :precondition (and
      (has_paint ?p ?m)
      (has_tool ?p ?t)
      (dirty ?t)
      (present ?o)
      (painted_under_coat ?o)
      (not (painted_second_coat ?o))
    )
    :effect (and
      (paint_applied ?o ?m)
      (painted_second_coat ?o)
      (dirty ?t)
    )
  )

  ;;   6：
  (:action finish_painting
    :parameters (?p - person ?o - object)
    :precondition (and
      (painted_second_coat ?o)
    )
    :effect (finished_painting ?o)
  )
)

; problem
(define (problem paint-bare-wood-problem)
  (:domain paint-bare-wood)

  (:objects
    ;;
    alice - person

    ;;
    paintbrush1 - tool

    ;;
    oil_paint1 - material

    ;;
    barewood1 - object
  )

  (:init
    ;;
    (not (has_paint alice oil_paint1))
    (not (has_tool alice paintbrush1))

    (present barewood1)

    (clean paintbrush1)

    ;;   alice
  )

  (:goal
    (and
      (finished_painting barewood1)
    )
  )
)

; plan
1. (acquire_tool alice paintbrush1)
   added: (has_tool alice paintbrush1)
   goals met: 0 of 1
2. (acquire_paint alice oil_paint1)
   added: (has_paint alice oil_paint1)
   goals met: 0 of 1
3. (apply_under_coat alice paintbrush1 oil_paint1 barewood1)
   added: (paint_applied barewood1 oil_paint1) (painted_under_coat barewood1) (dirty paintbrush1)
   goals met: 0 of 1
4. (apply_second_coat alice paintbrush1 oil_paint1 barewood1)
   added: (painted_second_coat barewood1)
   goals met: 0 of 1
5. (finish_painting alice barewood1)
   added: (finished_painting barewood1)
   goals met: 1 of 1
